server/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 100
      arrivalRate: 50
      rampTo: 1000
      name: Sustained load

scenarios:
  - name: "get data "
    flow:
      - get:
          url: "/testDb"